04/DIGITALBANK_USER_PROFILE-Combined-JMeter-and-Selenium.yml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: DIGITALBANK_USER_PROFILE-Selenium
  blazegrid: true
  
  capabilities: 
    browserName: chrome
  hold-for: 1m

- executor: jmeter
  scenario: DIGITALBANK_USER_PROFILE-Http
  concurrency: 20
  ramp-up: 30s
  hold-for: 30s

scenarios:
  DIGITALBANK_USER_PROFILE-Selenium:
    generate-flow-markers: true
    headless: false
    timeout: 60s
    think-time: 1s
    requests:
    - label: Login
      actions:
      - resizeWindow(1680,939)
      - go(http://<host>:<port>/bank/login)
      - clickByCSS(form)
      - clickByID(username)
      - typeByID(username): "jsmith@demo.io"
      - clickByID(password)
      - typeByID(password): "Demo123!"
      - clickByID(submit)
    - label: Click Profile
      actions:
      - clickByCSS(img.user-avatar.rounded-circle)
      - clickByLinkText(My Profile)
      - clickByID(firstName)
      - assertValueByID(firstName): "Josh"
      - clickByID(lastName)
      - assertValueByID(lastName): "Smith"
    - label: Home Page
      actions:
      - clickByCSS(img[alt="Logo"])
    - label: Logout
      actions:
      - clickByCSS(img.user-avatar.rounded-circle)
      - clickByLinkText(Logout)

  DIGITALBANK_USER_PROFILE-Http:
    headers:
      Upgrade-Insecure-Requests: '1'
      User-Agent: 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/86.0.4240.183 Safari/537.36'
      Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9'
    variables:
      BASE_URL: http://<host>:<port>
    requests:
      - transaction: Login
        force-parent-sample: false
        do:
          - url: '${BASE_URL}/bank/login - GET'
            method: GET
            label: '${BASE_URL}/bank/login - POST'
            think-time: 0ms
            headers: {}
          - url: '${BASE_URL}/bank/login'
            method: POST
            label: '${BASE_URL}/bank/login'
            think-time: 349ms
            headers:
              Origin: '${BASE_URL}'
              Content-Type: application/x-www-form-urlencoded
            body:
              password: 'Demo123!'
              username: jsmith@demo.io
      - transaction: Click Profile
        force-parent-sample: false
        do:
          - url: '${BASE_URL}/bank/user/profile'
            method: GET
            label: '${BASE_URL}/bank/user/profile'
            assert:
              - assume-success: false
                contains:
                  - Josh
                not: false
                regexp: false
                subject: body
              - assume-success: false
                contains:
                  - Smith
                not: false
                regexp: false
                subject: body
            think-time: 251ms
            headers: {}
      - transaction: Home Page
        force-parent-sample: false
        do:
          - url: '${BASE_URL}/bank/'
            method: GET
            label: '${BASE_URL}/bank/'
            think-time: 879ms
            headers: {}
      - transaction: Logout
        force-parent-sample: false
        do:
          - url: '${BASE_URL}/bank/logout'
            method: GET
            label: '${BASE_URL}/bank/logout'
            assert:
              - assume-success: false
                contains:
                  - "Logout completed"
                not: false
                regexp: false
                subject: body
            think-time: 144ms
            headers: {}